



PCE Working Group                                           S. Sivabalan
Internet-Draft                                         Ciena Corporation
Intended status: Standards Track                             C. Filsfils
Expires: October 1, 2021                             Cisco Systems, Inc.
                                                             J. Tantsura
                                                        Juniper Networks
                                                              S. Previdi
                                                                   C. Li
                                                     Huawei Technologies
                                                          March 30, 2021


    Carrying Binding Label/Segment Identifier in PCE-based Networks.
                  draft-ietf-pce-binding-label-sid-08

Abstract

   In order to provide greater scalability, network opacity, and service
   independence, Segment Routing (SR) utilizes a Binding Segment
   Identifier (BSID).  It is possible to associate a BSID to an RSVP-TE
   signaled Traffic Engineering Label Switching Path or an SR Traffic
   Engineering path.  The BSID can be used by an upstream node for
   steering traffic into the appropriate TE path to enforce SR policies.
   This document specifies the binding value as an MPLS label or Segment
   Identifier.  It further specify an approach for reporting binding
   label/SID by a Path Computation Client (PCC) to the Path Computation
   Element (PCE) to support PCE-based Traffic Engineering policies.

Status of This Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at https://datatracker.ietf.org/drafts/current/.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   This Internet-Draft will expire on October 1, 2021.







Sivabalan, et al.        Expires October 1, 2021                [Page 1]

Internet-Draft              Binding Label/SID                 March 2021


Copyright Notice

   Copyright (c) 2021 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents
   (https://trustee.ietf.org/license-info) in effect on the date of
   publication of this document.  Please review these documents
   carefully, as they describe your rights and restrictions with respect
   to this document.  Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.

Table of Contents

   1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   3
   2.  Requirements Language . . . . . . . . . . . . . . . . . . . .   5
   3.  Terminology . . . . . . . . . . . . . . . . . . . . . . . . .   5
   4.  Path Binding TLV  . . . . . . . . . . . . . . . . . . . . . .   6
     4.1.  SRv6 Endpoint Behavior and SID Structure  . . . . . . . .   7
   5.  Operation . . . . . . . . . . . . . . . . . . . . . . . . . .   8
   6.  Binding SID in SR-ERO . . . . . . . . . . . . . . . . . . . .  10
   7.  Binding SID in SRv6-ERO . . . . . . . . . . . . . . . . . . .  11
   8.  PCE Allocation of Binding label/SID . . . . . . . . . . . . .  11
   9.  Implementation Status . . . . . . . . . . . . . . . . . . . .  13
     9.1.  Huawei  . . . . . . . . . . . . . . . . . . . . . . . . .  13
     9.2.  Cisco . . . . . . . . . . . . . . . . . . . . . . . . . .  13
   10. Security Considerations . . . . . . . . . . . . . . . . . . .  14
   11. Manageability Considerations  . . . . . . . . . . . . . . . .  14
     11.1.  Control of Function and Policy . . . . . . . . . . . . .  14
     11.2.  Information and Data Models  . . . . . . . . . . . . . .  14
     11.3.  Liveness Detection and Monitoring  . . . . . . . . . . .  14
     11.4.  Verify Correct Operations  . . . . . . . . . . . . . . .  15
     11.5.  Requirements On Other Protocols  . . . . . . . . . . . .  15
     11.6.  Impact On Network Operations . . . . . . . . . . . . . .  15
   12. IANA Considerations . . . . . . . . . . . . . . . . . . . . .  15
     12.1.  PCEP TLV Type Indicators . . . . . . . . . . . . . . . .  15
       12.1.1.  TE-PATH-BINDING TLV  . . . . . . . . . . . . . . . .  15
     12.2.  LSP Object . . . . . . . . . . . . . . . . . . . . . . .  16
     12.3.  PCEP Error Type and Value  . . . . . . . . . . . . . . .  16
   13. Acknowledgements  . . . . . . . . . . . . . . . . . . . . . .  17
   14. References  . . . . . . . . . . . . . . . . . . . . . . . . .  17
     14.1.  Normative References . . . . . . . . . . . . . . . . . .  17
     14.2.  Informative References . . . . . . . . . . . . . . . . .  19
   Appendix A.  Contributor Addresses  . . . . . . . . . . . . . . .  20
   Authors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  20



Sivabalan, et al.        Expires October 1, 2021                [Page 2]

Internet-Draft              Binding Label/SID                 March 2021


1.  Introduction

   A Path Computation Element (PCE) can compute Traffic Engineering
   paths (TE paths) through a network where those paths are subject to
   various constraints.  Currently, TE paths are either set up using the
   RSVP-TE signaling protocol or Segment Routing (SR).  We refer to such
   paths as RSVP-TE paths and SR-TE paths respectively in this document.

   As per [RFC8402] SR allows a headend node to steer a packet flow
   along any path.  The headend node is said to steer a flow into an
   Segment Routing Policy (SR Policy).  Further, as per
   [I-D.ietf-spring-segment-routing-policy], an SR Policy is a framework
   that enables instantiation of an ordered list of segments on a node
   for implementing a source routing policy with a specific intent for
   traffic steering from that node.

   As described in [RFC8402], a Binding Segment Identifier (BSID) is
   bound to a Segment Routed (SR) Policy, instantiation of which may
   involve a list of SIDs.  Any packets received with an active segment
   equal to a BSID are steered onto the bound SR Policy.  A BSID may be
   either a local (SR Local Block (SRLB)) or a global (SR Global Block
   (SRGB)) SID.  As per Section 6.4 of
   [I-D.ietf-spring-segment-routing-policy] a BSID can also be
   associated with any type of interfaces or tunnel to enable the use of
   a non-SR interface or tunnel as a segment in a SID-list.  In this
   document, binding label/SID is used to generalize the allocation of
   binding value for both SR and non-SR paths.

   [RFC5440] describes the Path Computation Element Protocol (PCEP) for
   communication between a Path Computation Client (PCC) and a PCE or
   between a pair of PCEs as per [RFC4655].  [RFC8231] specifies
   extensions to PCEP that allow a PCC to delegate its Label Switched
   Paths (LSPs) to a stateful PCE.  A stateful PCE can then update the
   state of LSPs delegated to it.  [RFC8281] specifies a mechanism
   allowing a PCE to dynamically instantiate an LSP on a PCC by sending
   the path and characteristics.

   [RFC8664] provides a mechanism for a network controller (acting as a
   PCE) to instantiate SR-TE paths (candidate paths) for an SR Policy
   onto a head-end node (acting as a PCC) using PCEP.  For more
   information on the SR Policy Architecture, see
   [I-D.ietf-spring-segment-routing-policy].

   A binding label/SID has local significance to the ingress node of the
   corresponding TE path.  When a stateful PCE is deployed for setting
   up TE paths, it may be desirable for PCC to report the binding label/
   SID to the stateful PCE for the purpose of enforcing end-to-end TE/SR
   policy.  A sample Data Center (DC) use-case is illustrated in the



Sivabalan, et al.        Expires October 1, 2021                [Page 3]

Internet-Draft              Binding Label/SID                 March 2021


   Figure 1.  In the MPLS DC network, an SR LSP (without traffic
   engineering) is established using a prefix SID advertised by BGP (see
   [RFC8669]).  In the IP/MPLS WAN, an SR-TE LSP is set up using the
   PCE.  The list of SIDs of the SR-TE LSP is {A, B, C, D}. The gateway
   node 1 (which is the PCC) allocates a binding SID X and reports it to
   the PCE.  In order for the access node to steer the traffic over the
   SR-TE LSP, the PCE passes the SID stack {Y, X} where Y is the prefix
   SID of the gateway node-1 to the access node.  In the absence of the
   binding SID X, the PCE should pass the SID stack {Y, A, B, C, D} to
   the access node.  This example also illustrates the additional
   benefit of using the binding SID to reduce the number of SIDs imposed
   on the access nodes with a limited forwarding capacity.


           SID stack
           {Y, X}              +-----+
    _ _ _ _ _ _ _ _ _ _ _ _ _ _| PCE |
   |                           +-----+
   |                              ^
   |                              | Binding
   |           .-----.            | SID (X)     .-----.
   |          (       )           |            (       )
   V       .--(         )--.      |        .--(         )--.
+------+  (                 )  +-------+  (                 )  +-------+
|Access|_(  MPLS DC Network  )_|Gateway|_(    IP/MPLS WAN    )_|Gateway|
| Node | (  ==============>  ) |Node-1 | ( ================> ) |Node-2 |
+------+  (     SR path     )  +-------+  (    SR-TE path   )  +-------+
           '--(         )--'    Prefix     '--(         )--'
               (       )        SID of         (       )
                '-----'         Node-1          '-----'
                                is Y            SIDs for SR-TE LSP:
                                                {A, B, C, D}



                Figure 1: A sample Use-case of Binding SID

   A PCC could report the binding label/SID allocated by it to the
   stateful PCE via Path Computation State Report (PCRpt) message.  It
   is also possible for a stateful PCE to request a PCC to allocate a
   specific binding label/SID by sending a Path Computation Update
   Request (PCUpd) message.  If the PCC can successfully allocate the
   specified binding value, it reports the binding value to the PCE.
   Otherwise, the PCC sends an error message to the PCE indicating the
   cause of the failure.  A local policy or configuration at the PCC
   SHOULD dictate if the binding label/SID needs to be assigned.





Sivabalan, et al.        Expires October 1, 2021                [Page 4]

Internet-Draft              Binding Label/SID                 March 2021


   In this document, we introduce a new OPTIONAL TLV that a PCC can use
   in order to report the binding label/SID associated with a TE LSP, or
   a PCE to request a PCC to allocate a specific binding label/SID
   value.  This TLV is intended for TE LSPs established using RSVP-TE,
   SR, or any other future method.  Also, in the case of SR-TE LSPs, the
   TLV can carry a binding label (for SR-TE path with MPLS data-plane)
   or a binding IPv6 SID (e.g., IPv6 address for SR-TE paths with IPv6
   data-plane).  Throughout this document, the term "binding value"
   means either an MPLS label or SID.

   Additionally, to support the PCE based central controller [RFC8283]
   operation where the PCE would take responsibility for managing some
   part of the MPLS label space for each of the routers that it
   controls, the PCE could directly make the binding label/SID
   allocation and inform the PCC.  See Section 8 for details.

2.  Requirements Language

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "NOT RECOMMENDED", "MAY", and
   "OPTIONAL" in this document are to be interpreted as described in BCP
   14 [RFC2119] [RFC8174] when, and only when, they appear in all
   capitals, as shown here.

3.  Terminology

   The following terminologies are used in this document:

   BSID:  Binding Segment Identifier.

   LSP:  Label Switched Path.

   PCC:  Path Computation Client.

   PCE:  Path Computation Element

   PCEP:  Path Computation Element Protocol.

   RSVP-TE:  Resource ReserVation Protocol-Traffic Engineering.

   SID:  Segment Identifier.

   SR:  Segment Routing.

   TLV:  Type, Length, and Value.






Sivabalan, et al.        Expires October 1, 2021                [Page 5]

Internet-Draft              Binding Label/SID                 March 2021


4.  Path Binding TLV

   The new optional TLV is called "TE-PATH-BINDING TLV" (whose format is
   shown in the Figure 2) is defined to carry the binding label/SID for
   a TE path.  This TLV is associated with the LSP object specified in
   [RFC8231].  This TLV can also be carried in the PCEP-ERROR object
   [RFC5440] in case of error.  Multiple instance of TE-PATH-BINDING
   TLVs MAY be present in the LSP and PCEP-ERROR object.  The type of
   this TLV is 55 (early allocated by IANA).  The length is variable.

       0                   1                   2                   3
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |             Type              |             Length            |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |      BT       |    Flags      |            Reserved           |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      ~            Binding Value (variable length)                    ~
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


                       Figure 2: TE-PATH-BINDING TLV

   TE-PATH-BINDING TLV is a generic TLV such that it is able to carry
   binding label/SID (i.e.  MPLS label or SRv6 SID).  It is formatted
   according to the rules specified in [RFC5440].  The value portion of
   the TLV comprise of:

   Binding Type (BT): A one-octet field identifies the type of binding
   included in the TLV.  This document specifies the following BT
   values:

   o  BT = 0: The binding value is a 20-bit MPLS label value.  The TLV
      is padded to 4-bytes alignment.  The Length MUST be set to 7 and
      first 20 bits are used to encode the MPLS label value.

   o  BT = 1: The binding value is a 32-bit MPLS label stack entry as
      per [RFC3032] with Label, TC [RFC5462], S, and TTL values encoded.
      Note that the receiver MAY choose to override TC, S, and TTL
      values according to its local policy.  The Length MUST be set to
      8.

   o  BT = 2: The binding value is an SRv6 SID with a format of a 16
      octet IPv6 address, representing the binding SID for SRv6.  The
      Length MUST be set to 20.






Sivabalan, et al.        Expires October 1, 2021                [Page 6]

Internet-Draft              Binding Label/SID                 March 2021


   o  BT = 3: The binding value is a 24 octet field, defined in
      Section 4.1, that contains the SRv6 SID as well as its Behavior
      and Structure.  The Length MUST be set to 28.

   Section 12.1.1 defines the IANA registry used to maintain all these
   binding types as well as any future ones.  Multiple TE-PATH-BINDING
   TLVs with different Binding Types MAY be present for the same LSP.

   Flags: 1 octet of flags.  Following flags are defined in the new
   registry "TE-PATH-BINDING TLV Flag field" as described in
   Section 12.1.1:


      0 1 2 3 4 5 6 7
     +-+-+-+-+-+-+-+-+
     |           |I|S|
     +-+-+-+-+-+-+-+-+


                              Figure 3: Flags

   where:

   o  S-Flag: This flag encodes the "Specified-BSID-only" behavior.  It
      is used as described in Section 6.2.3 of
      [I-D.ietf-spring-segment-routing-policy].

   o  I-Flag: This flag encodes the "Drop Upon Invalid" behavior.  It is
      used as described in Section 8.2 of
      [I-D.ietf-spring-segment-routing-policy].

   o  Unassigned bits MUST be set to 0 while sending and ignored on
      receipt.

   Reserved: MUST be set to 0 while sending and ignored on receipt.

   Binding Value: A variable-length field, padded with trailing zeros to
   a 4-octet boundary.  For the BT as 0, the 20 bits represent the MPLS
   label.  For the BT as 1, the 32-bits represent the MPLS label stack
   entry as per [RFC3032].  For the BT as 2, the 128-bits represent the
   SRv6 SID.  For the BT as 3, the Binding Value also contains the SRv6
   Endpoint Behavior and SID Structure, defined in Section 4.1.

4.1.  SRv6 Endpoint Behavior and SID Structure

   This section specify the format of the Binding Value in the TE-PATH-
   BINDING TLV when the BT is set to 3 for the SRv6 Binding SIDs
   [RFC8986], as shown in Figure 4.



Sivabalan, et al.        Expires October 1, 2021                [Page 7]

Internet-Draft              Binding Label/SID                 March 2021


       0                   1                   2                   3
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                 SRv6 Binding SID (16 octets)                  |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |         Reserved              |      Endpoint Behavior        |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |    LB Length  |    LN Length  | Fun. Length   |  Arg. Length  |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


            Figure 4: SRv6 Endpoint Behavior and SID Structure

   The Binding Value consist of:

   o  SRv6 Binding SID: 16 octets.  The 128-bits IPv6 address,
      representing the binding SID for SRv6.

   o  Reserved: 2 octets.  It MUST be set to 0 on transmit and ignored
      on receipt.

   o  Endpoint Behavior: 2 octets.  The Endpoint Behavior code point for
      this SRv6 SID as per the IANA subregistry called "SRv6 Endpoint
      Behaviors", created by [RFC8986].  When the field is set with the
      value 0, the endpoint behavior is considered unknown.

   o  The following fields are used to advertise the length of each
      individual part of the SRv6 SID as defined in [RFC8986]:

      *  LB Length: 1 octet.  SRv6 SID Locator Block length in bits.

      *  LN Length: 1 octet.  SRv6 SID Locator Node length in bits.

      *  Function Length: 1 octet.  SRv6 SID Function length in bits.

      *  Argument Length: 1 octet.  SRv6 SID Arguments length in bits.

5.  Operation

   The binding value is allocated by the PCC and reported to a PCE via
   PCRpt message.  If a PCE does not recognize the TE-PATH-BINDING TLV,
   it would ignore the TLV in accordance with [RFC5440].  If a PCE
   recognizes the TLV but does not support the TLV, it MUST send PCErr
   with Error-Type = 2 (Capability not supported).

   Multiple TE-PATH-BINDING TLVs are allowed to be present in the same
   LSP object.  This signifies the presence of multiple binding SIDs for
   the given LSP.  In case of multiple TE-PATH-BINDING TLVs, all



Sivabalan, et al.        Expires October 1, 2021                [Page 8]

Internet-Draft              Binding Label/SID                 March 2021


   existing instances of TE-PATH-BINDING TLVs MUST always be included in
   the LSP object.  In case of an error condition, the whole message is
   rejected and the resulting PCErr message MAY include the offending
   TE-PATH-BINDING TLV in the PCEP-ERROR object.

   If a TE-PATH-BINDING TLV is absent in the PCRpt message, the PCE MUST
   assume that the corresponding LSP does not have any binding.  If a
   PCE recognizes an invalid binding value (e.g., label value from the
   reserved MPLS label space), it MUST send a PCErr message with Error-
   Type = 10 ("Reception of an invalid object") and Error Value = 2
   ("Bad label value") as specified in [RFC8664].

   For SRv6 BSIDs, it is RECOMMENDED to always explicitly specify the
   SRv6 Endpoint Behavior and SID Structure in the TE-PATH-BINDING TLV
   by setting the BT (Binding Type) to 3.  This enables the sender to
   have control of the SRv6 Endpoint Behavior and SID Structure.  A
   sender MAY choose to set the BT to 2, in which case the receiving
   implementation chooses how to interpret the SRv6 Endpoint Behavior
   and SID Structure according to local policy.

   If a PCE requires a PCC to allocate a specific binding value(s), it
   may do so by sending a PCUpd or PCInitiate message containing a TE-
   PATH-BINDING TLV(s).  If the value(s) can be successfully allocated,
   the PCC reports the binding value(s) to the PCE.  If the PCC
   considers the binding value specified by the PCE invalid, it MUST
   send a PCErr message with Error-Type = TBD2 ("Binding label/SID
   failure") and Error Value = TBD3 ("Invalid SID").  If the binding
   value is valid, but the PCC is unable to allocate the binding value,
   it MUST send a PCErr message with Error-Type = TBD2 ("Binding label/
   SID failure") and Error Value = TBD4 ("Unable to allocate the
   specified binding value").  Note that in case of an error, the PCC
   rejects the PCUpd or PCInitiate message in its entirety and can carry
   the offending TE-PATH-BINDING TLV in the PCEP-ERROR object.

   If a PCC receives a TE-PATH-BINDING TLV in any message other than
   PCUpd or PCInitiate, it MUST close the corresponding PCEP session
   with the reason "Reception of a malformed PCEP message" (according to
   [RFC5440]).  Similarly, if a PCE receives a TE-PATH-BINDING TLV in
   any message other than a PCRpt or if the TE-PATH-BINDING TLV is
   associated with any object other than an LSP or PCEP-ERROR object,
   the PCE MUST close the corresponding PCEP session with the reason
   "Reception of a malformed PCEP message" (according to [RFC5440]).

   If a PCC wishes to withdraw all previously reported binding values,
   it MUST send a PCRpt message without any TE-PATH-BINDING TLV.  If a
   PCC wishes to modify any or all previously reported binding values,
   it MUST send a PCRpt message containing TE-PATH-BINDING TLVs
   containing all the binding values that apply from that point on.



Sivabalan, et al.        Expires October 1, 2021                [Page 9]

Internet-Draft              Binding Label/SID                 March 2021


   If a PCE wishes to modify a previously requested binding value, it
   MUST send a PCUpd message with TE-PATH-BINDING TLVs containing all
   the binding values that apply from that point on.  The absence of TE-
   PATH-BINDING TLV in PCUpd message means that the PCE does not specify
   a binding value.  Any previously allocated binding values are
   considered to be requested to be withdrawn by the PCE.

   If a PCC receives a new valid binding value from the PCE, it MUST try
   to allocate the new binding value.  If a PCC does not receive an old
   binding value for the PCE, it MUST withdraw the old binding value.
   If the new binding value is successfully allocated, the PCC MUST
   report the new value to the PCE.  Otherwise, it MUST send a PCErr
   message with Error-Type = TBD2 ("Binding label/SID failure") and
   Error Value = TBD4 ("Unable to allocate the specified binding
   value").  Note that, all instances of TE-PATH-BINDING TLV that
   remains unchanged are always included in the LSP object and the
   offending TE-PATH-BINDING TLV is included in the PCEP-ERROR object.

   In some cases, a stateful PCE can request the PCC to allocate a
   binding value.  It instructs the PCC by sending a PCUpd message
   containing an empty TE-PATH-BINDING TLV, i.e., no binding value is
   specified (making the length field of the TLV as 4).  A PCE can also
   request PCC to allocate a binding value at the time of initiation by
   sending a PCInitiate message with an empty TE-PATH-BINDING TLV.  Only
   one such instance of empty TE-PATH-BINDING TLV SHOULD be included in
   the LSP object and other ignored on receipt.  If the PCC is unable to
   allocate a new binding value as per the specified BT, it MUST send a
   PCErr message with Error-Type = TBD2 ("Binding label/SID failure")
   and Error-Value = TBD5 ("Unable to allocate a new binding label/
   SID").

   In the absence of any instruction from the PCE, the PCC's local
   policy dictates how the binding allocations are made for a given LSP.

   As previously noted, if a message contains an invalid TE-PATH-BINDING
   TLV that leads to an error condition, the whole message is rejected
   including any other valid instances of TE-PATH-BINDING TLVs, if any.
   The resulting error message, MAY include the offending TE-PATH-
   BINDING TLV in the PCEP-ERROR object.

6.  Binding SID in SR-ERO

   In PCEP messages, LSP route information is carried in the Explicit
   Route Object (ERO), which consists of a sequence of subobjects.
   [RFC8664] defines a new ERO subobject "SR-ERO subobject" capable of
   carrying a SID as well as the identity of the node/adjacency (NAI)
   represented by the SID.  The NAI Type (NT) field indicates the type
   and format of the NAI contained in the SR-ERO.  In case of binding



Sivabalan, et al.        Expires October 1, 2021               [Page 10]

Internet-Draft              Binding Label/SID                 March 2021


   SID, the NAI MUST NOT be included and NT MUST be set to zero.  So as
   per Section 5.2.1 of [RFC8664], for NT=0, the F bit is set to 1, the
   S bit needs to be zero and the Length is 8.  Further, the M bit is
   set.  If these conditions are not met, the entire ERO MUST be
   considered invalid and a PCErr message is sent by the PCC with Error-
   Type = 10 ("Reception of an invalid object") and Error-Value = 11
   ("Malformed object").

7.  Binding SID in SRv6-ERO

   [I-D.ietf-pce-segment-routing-ipv6] defines a new ERO subobject
   "SRv6-ERO subobject" for an SRv6 SID.  As stated in Section 6, in
   case of binding SID, the NAI is not included and NT is set to zero
   i.e., NT=0, the F bit is set to 1, the S bit needs to be zero and the
   Length is 24 [I-D.ietf-pce-segment-routing-ipv6].  As per [RFC8664],
   if these conditions are not met, the entire ERO is considered invalid
   and a PCErr message is sent by the PCC with Error-Type = 10
   ("Reception of an invalid object") and Error-Value = 11 ("Malformed
   object").

8.  PCE Allocation of Binding label/SID

   Section 5 already includes the scenario where a PCE requires a PCC to
   allocate a specified binding value by sending a PCUpd or PCInitiate
   message containing a TE-PATH-BINDING TLV.  This section specifies an
   OPTIONAL feature for the PCE to allocate the binding label/SID on its
   own accord in the case where the PCE also controls the label space of
   the PCC and can make the label allocation on its own as described in
   [RFC8283].  Note that the act of requesting a specific binding value
   (Section 5) is different from the act of allocating a binding label/
   SID as described in this section.

   [RFC8283] introduces the architecture for PCE as a central controller
   as an extension of the architecture described in [RFC4655] and
   assumes the continued use of PCEP as the protocol used between PCE
   and PCC.  [I-D.ietf-pce-pcep-extension-for-pce-controller] specifies
   the procedures and PCEP extensions for using the PCE as the central
   controller.

   For an implementation that supports PCECC operations as per
   [I-D.ietf-pce-pcep-extension-for-pce-controller], the binding label/
   SID MAY also be allocated by the PCE itself.  Both peers need to
   exchange the PCECC capability as described in
   [I-D.ietf-pce-pcep-extension-for-pce-controller] before the PCE can
   allocate the binding label/SID on its own.

   A new P flag in the LSP object [RFC8231] is introduced to indicate
   the allocation needs to be made by the PCE:



Sivabalan, et al.        Expires October 1, 2021               [Page 11]

Internet-Draft              Binding Label/SID                 March 2021


   o  P (PCE-allocated binding label/SID): If the bit is set to 1, it
      indicates that the PCC requests PCE to make allocations for this
      LSP.  The TE-PATH-BINDING TLV in the LSP object identifies that
      the allocation is for binding label/SID.  A PCC would set this bit
      to 1 and include a TE-PATH-BINDING TLV in the LSP object to
      request for allocation of binding label/SID by the PCE in the PCEP
      message.  A PCE would also set this bit to 1 and include a TE-
      PATH-BINDING TLV to indicate that the binding label/SID is
      allocated by PCE and encoded in the PCEP message towards PCC.
      Further, a PCE would set this bit to 0 and include a TE-PATH-
      BINDING TLV in the LSP object to indicate that the binding label/
      SID should be allocated by the PCC as described in Section 5.

   Note that -

   o  A PCE could allocate the binding label/SID on its own accord for a
      PCE-initiated or delegated LSP, and inform the PCC in the
      PCInitiate message or PCUpd message by setting P=1 and including
      TE-PATH-BINDING TLV in the LSP object.

   o  To let the PCC allocates the binding label/SID, a PCE could set
      P=0 and include an empty TE-PATH-BINDING TLV ( i.e., no binding
      value is specified) in the LSP object in PCInitiate/PCUpd message.

   o  A PCC could request that the PCE allocate the binding label/SID by
      setting P=1, D=1, and including an empty TE-PATH-BINDING TLV in
      PCRpt message.  The PCE would allocate it and respond to the PCC
      with PCUpd message including the allocated binding label/SID in
      the TE-PATH-BINDING TLV and P=1, D=1 in the LSP object.

   o  If both peers have not exchanged the PCECC capabilities as per
      [I-D.ietf-pce-pcep-extension-for-pce-controller] and a PCEP peer
      receives P=1 in the LSP object, it needs to act as per
      [I-D.ietf-pce-pcep-extension-for-pce-controller]:

      *  Send a PCErr message with Error-Type=19 (Invalid Operation) and
         Error-Value=16 (Attempted PCECC operations when PCECC
         capability was not advertised)

      *  Terminate the PCEP session

   It is assumed that the label range to be used by a PCE is known and
   set on both PCEP peers.  The exact mechanism is out of scope of
   [I-D.ietf-pce-pcep-extension-for-pce-controller] or this document.
   Note that the specific BSID could be from the PCE-controlled or the
   PCC-controlled label space.  The PCE can directly allocate the label
   from the PCE-controlled label space using P=1 as described above,
   whereas the PCE can request for the allocation of a specific BSID



Sivabalan, et al.        Expires October 1, 2021               [Page 12]

Internet-Draft              Binding Label/SID                 March 2021


   from the PCC-controlled label space with P=0 as described in
   Section 5.

9.  Implementation Status

   [Note to the RFC Editor - remove this section before publication, as
   well as remove the reference to RFC 7942.]

   This section records the status of known implementations of the
   protocol defined by this specification at the time of posting of this
   Internet-Draft, and is based on a proposal described in [RFC7942].
   The description of implementations in this section is intended to
   assist the IETF in its decision processes in progressing drafts to
   RFCs.  Please note that the listing of any individual implementation
   here does not imply endorsement by the IETF.  Furthermore, no effort
   has been spent to verify the information presented here that was
   supplied by IETF contributors.  This is not intended as, and must not
   be construed to be, a catalog of available implementations or their
   features.  Readers are advised to note that other implementations may
   exist.

   According to [RFC7942], "this will allow reviewers and working groups
   to assign due consideration to documents that have the benefit of
   running code, which may serve as evidence of valuable experimentation
   and feedback that have made the implemented protocols more mature.
   It is up to the individual working groups to use this information as
   they see fit".

9.1.  Huawei

   o  Organization: Huawei

   o  Implementation: Huawei's Router and Controller

   o  Description: An experimental code-point is used and plan to
      request early code-point allocation from IANA after WG adoption.

   o  Maturity Level: Production

   o  Coverage: Full

   o  Contact: chengli13@huawei.com

9.2.  Cisco

   o  Organization: Cisco Systems

   o  Implementation: Head-end and controller.



Sivabalan, et al.        Expires October 1, 2021               [Page 13]

Internet-Draft              Binding Label/SID                 March 2021


   o  Description: An experimental code-point is currently used.

   o  Maturity Level: Production

   o  Coverage: Full

   o  Contact: mkoldych@cisco.com

10.  Security Considerations

   The security considerations described in [RFC5440], [RFC8231],
   [RFC8281] and [RFC8664] are applicable to this specification.  No
   additional security measure is required.

   As described [RFC8664], SR allows a network controller to instantiate
   and control paths in the network.  A rogue PCE can manipulate binding
   SID allocations to move traffic around for some other LSP that uses
   BSID in its SR-ERO.

   Thus, as per [RFC8231], it is RECOMMENDED that these PCEP extensions
   only be activated on authenticated and encrypted sessions across PCEs
   and PCCs belonging to the same administrative authority, using
   Transport Layer Security (TLS) [RFC8253], as per the recommendations
   and best current practices in BCP195 [RFC7525] (unless explicitly set
   aside in [RFC8253]).

11.  Manageability Considerations

   All manageability requirements and considerations listed in
   [RFC5440], [RFC8231], and [RFC8664] apply to PCEP protocol extensions
   defined in this document.  In addition, requirements and
   considerations listed in this section apply.

11.1.  Control of Function and Policy

   A PCC implementation SHOULD allow the operator to configure the
   policy based on which PCC needs to allocates the binding label/SID.

11.2.  Information and Data Models

   The PCEP YANG module [I-D.ietf-pce-pcep-yang] could be extended to
   include policy configuration for binding label/SID allocation.

11.3.  Liveness Detection and Monitoring

   Mechanisms defined in this document do not imply any new liveness
   detection and monitoring requirements in addition to those already
   listed in [RFC5440].



Sivabalan, et al.        Expires October 1, 2021               [Page 14]

Internet-Draft              Binding Label/SID                 March 2021


11.4.  Verify Correct Operations

   Mechanisms defined in this document do not imply any new operation
   verification requirements in addition to those already listed in
   [RFC5440], [RFC8231], and [RFC8664].

11.5.  Requirements On Other Protocols

   Mechanisms defined in this document do not imply any new requirements
   on other protocols.

11.6.  Impact On Network Operations

   Mechanisms defined in [RFC5440], [RFC8231], and [RFC8664] also apply
   to PCEP extensions defined in this document.  Further, the mechanism
   described in this document can help the operator to request control
   of the LSPs at a particular PCE.

12.  IANA Considerations

   IANA maintains the "Path Computation Element Protocol (PCEP) Numbers"
   registry.  This document requests IANA actions to allocate code
   points for the protocol elements defined in this document.

12.1.  PCEP TLV Type Indicators

   This document defines a new PCEP TLV; IANA is requested to confirm
   the following early allocations from the "PCEP TLV Type Indicators"
   subregistry of the PCEP Numbers registry, as follows:

                Value    Description           Reference

                  55     TE-PATH-BINDING       This document

12.1.1.  TE-PATH-BINDING TLV

   IANA is requested to create a new subregistry "TE-PATH-BINDING TLV BT
   field" to manage the value of the Binding Type field in the TE-PATH-
   BINDING TLV.  Initial values for the subregistry are given below.
   New values are assigned by Standards Action [RFC8126].











Sivabalan, et al.        Expires October 1, 2021               [Page 15]

Internet-Draft              Binding Label/SID                 March 2021


                Value    Description           Reference

                  0      MPLS Label            This document
                  1      MPLS Label Stack      This document
                         Entry
                  2      SRv6 SID              This document
                  3      SRv6 SID with         This document
                         Behavior and
                         Structure
                4-255    Unassigned            This document

   IANA is requested to create a new subregistry "TE-PATH-BINDING TLV
   Flag field" to manage the Flag field in the TE-PATH-BINDING TLV.  New
   values are to be assigned by Standards Action [RFC8126].  Each bit
   should be tracked with the following qualities:

   o  Bit number (count from 0 as the most significant bit)

   o  Description

   o  Reference

                 Bit     Description           Reference

                  7      Specified-BSID-Only   This document
                         Flag (S-Flag)
                  6      Drop Upon Invalid     This document
                         Flag (I-Flag)
                 0-5     Unassigned            This document

12.2.  LSP Object

   IANA is requested to confirm the early allocation for a new code-
   point in the "LSP Object Flag Field" sub-registry for the new P flag
   as follows:

                 Bit     Description           Reference

                  0      PCE-allocated binding This document
                         label/SID

12.3.  PCEP Error Type and Value

   This document defines a new Error-type and Error-Values for the PCErr
   message.  IANA is requested to allocate new error-type and error-
   values within the "PCEP-ERROR Object Error Types and Values"
   subregistry of the PCEP Numbers registry, as follows:




Sivabalan, et al.        Expires October 1, 2021               [Page 16]

Internet-Draft              Binding Label/SID                 March 2021


   Error-Type Meaning            Error-value                   Reference

      TBD2    Binding label/SID                                This
              failure                                          document
                                 TBD3: Invalid SID             This
                                                               document
                                 TBD4: Unable to allocate the  This
                                 specified binding value       document
                                 TBD5: Unable to allocate a    This
                                 new binding label/SID         document

13.  Acknowledgements

   We like to thank Milos Fabian, Mrinmoy Das, Andrew Stone, Tom Petch,
   Aijun Wang, Olivier Dugeon, and Adrian Farrel for their valuable
   comments.

14.  References

14.1.  Normative References

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119,
              DOI 10.17487/RFC2119, March 1997,
              <https://www.rfc-editor.org/info/rfc2119>.

   [RFC3032]  Rosen, E., Tappan, D., Fedorkow, G., Rekhter, Y.,
              Farinacci, D., Li, T., and A. Conta, "MPLS Label Stack
              Encoding", RFC 3032, DOI 10.17487/RFC3032, January 2001,
              <https://www.rfc-editor.org/info/rfc3032>.

   [RFC5440]  Vasseur, JP., Ed. and JL. Le Roux, Ed., "Path Computation
              Element (PCE) Communication Protocol (PCEP)", RFC 5440,
              DOI 10.17487/RFC5440, March 2009,
              <https://www.rfc-editor.org/info/rfc5440>.

   [RFC5462]  Andersson, L. and R. Asati, "Multiprotocol Label Switching
              (MPLS) Label Stack Entry: "EXP" Field Renamed to "Traffic
              Class" Field", RFC 5462, DOI 10.17487/RFC5462, February
              2009, <https://www.rfc-editor.org/info/rfc5462>.

   [RFC7525]  Sheffer, Y., Holz, R., and P. Saint-Andre,
              "Recommendations for Secure Use of Transport Layer
              Security (TLS) and Datagram Transport Layer Security
              (DTLS)", BCP 195, RFC 7525, DOI 10.17487/RFC7525, May
              2015, <https://www.rfc-editor.org/info/rfc7525>.





Sivabalan, et al.        Expires October 1, 2021               [Page 17]

Internet-Draft              Binding Label/SID                 March 2021


   [RFC7942]  Sheffer, Y. and A. Farrel, "Improving Awareness of Running
              Code: The Implementation Status Section", BCP 205,
              RFC 7942, DOI 10.17487/RFC7942, July 2016,
              <https://www.rfc-editor.org/info/rfc7942>.

   [RFC8174]  Leiba, B., "Ambiguity of Uppercase vs Lowercase in RFC
              2119 Key Words", BCP 14, RFC 8174, DOI 10.17487/RFC8174,
              May 2017, <https://www.rfc-editor.org/info/rfc8174>.

   [RFC8231]  Crabbe, E., Minei, I., Medved, J., and R. Varga, "Path
              Computation Element Communication Protocol (PCEP)
              Extensions for Stateful PCE", RFC 8231,
              DOI 10.17487/RFC8231, September 2017,
              <https://www.rfc-editor.org/info/rfc8231>.

   [RFC8253]  Lopez, D., Gonzalez de Dios, O., Wu, Q., and D. Dhody,
              "PCEPS: Usage of TLS to Provide a Secure Transport for the
              Path Computation Element Communication Protocol (PCEP)",
              RFC 8253, DOI 10.17487/RFC8253, October 2017,
              <https://www.rfc-editor.org/info/rfc8253>.

   [RFC8281]  Crabbe, E., Minei, I., Sivabalan, S., and R. Varga, "Path
              Computation Element Communication Protocol (PCEP)
              Extensions for PCE-Initiated LSP Setup in a Stateful PCE
              Model", RFC 8281, DOI 10.17487/RFC8281, December 2017,
              <https://www.rfc-editor.org/info/rfc8281>.

   [RFC8402]  Filsfils, C., Ed., Previdi, S., Ed., Ginsberg, L.,
              Decraene, B., Litkowski, S., and R. Shakir, "Segment
              Routing Architecture", RFC 8402, DOI 10.17487/RFC8402,
              July 2018, <https://www.rfc-editor.org/info/rfc8402>.

   [RFC8664]  Sivabalan, S., Filsfils, C., Tantsura, J., Henderickx, W.,
              and J. Hardwick, "Path Computation Element Communication
              Protocol (PCEP) Extensions for Segment Routing", RFC 8664,
              DOI 10.17487/RFC8664, December 2019,
              <https://www.rfc-editor.org/info/rfc8664>.

   [RFC8126]  Cotton, M., Leiba, B., and T. Narten, "Guidelines for
              Writing an IANA Considerations Section in RFCs", BCP 26,
              RFC 8126, DOI 10.17487/RFC8126, June 2017,
              <https://www.rfc-editor.org/info/rfc8126>.

   [RFC8986]  Filsfils, C., Ed., Camarillo, P., Ed., Leddy, J., Voyer,
              D., Matsushima, S., and Z. Li, "Segment Routing over IPv6
              (SRv6) Network Programming", RFC 8986,
              DOI 10.17487/RFC8986, February 2021,
              <https://www.rfc-editor.org/info/rfc8986>.



Sivabalan, et al.        Expires October 1, 2021               [Page 18]

Internet-Draft              Binding Label/SID                 March 2021


   [I-D.ietf-pce-pcep-extension-for-pce-controller]
              Li, Z., Peng, S., Negi, M., Zhao, Q., and C. Zhou, "PCEP
              Procedures and Protocol Extensions for Using PCE as a
              Central Controller (PCECC) of LSPs", draft-ietf-pce-pcep-
              extension-for-pce-controller-10 (work in progress),
              January 2021.

14.2.  Informative References

   [RFC4655]  Farrel, A., Vasseur, J., and J. Ash, "A Path Computation
              Element (PCE)-Based Architecture", RFC 4655,
              DOI 10.17487/RFC4655, August 2006,
              <https://www.rfc-editor.org/info/rfc4655>.

   [RFC8283]  Farrel, A., Ed., Zhao, Q., Ed., Li, Z., and C. Zhou, "An
              Architecture for Use of PCE and the PCE Communication
              Protocol (PCEP) in a Network with Central Control",
              RFC 8283, DOI 10.17487/RFC8283, December 2017,
              <https://www.rfc-editor.org/info/rfc8283>.

   [RFC8669]  Previdi, S., Filsfils, C., Lindem, A., Ed., Sreekantiah,
              A., and H. Gredler, "Segment Routing Prefix Segment
              Identifier Extensions for BGP", RFC 8669,
              DOI 10.17487/RFC8669, December 2019,
              <https://www.rfc-editor.org/info/rfc8669>.

   [I-D.ietf-spring-segment-routing-policy]
              Filsfils, C., Talaulikar, K., Voyer, D., Bogdanov, A., and
              P. Mattes, "Segment Routing Policy Architecture", draft-
              ietf-spring-segment-routing-policy-09 (work in progress),
              November 2020.

   [I-D.ietf-pce-pcep-yang]
              Dhody, D., Hardwick, J., Beeram, V., and J. Tantsura, "A
              YANG Data Model for Path Computation Element
              Communications Protocol (PCEP)", draft-ietf-pce-pcep-
              yang-15 (work in progress), October 2020.

   [I-D.ietf-pce-segment-routing-ipv6]
              Li, C., Negi, M., Sivabalan, S., Koldychev, M.,
              Kaladharan, P., and Y. Zhu, "PCEP Extensions for Segment
              Routing leveraging the IPv6 data plane", draft-ietf-pce-
              segment-routing-ipv6-08 (work in progress), November 2020.








Sivabalan, et al.        Expires October 1, 2021               [Page 19]

Internet-Draft              Binding Label/SID                 March 2021


Appendix A.  Contributor Addresses

   Jonathan Hardwick
   Metaswitch Networks
   33 Genotin Road
   Enfield
   United Kingdom

   EMail: Jonathan.Hardwick@metaswitch.com


   Dhruv Dhody
   Huawei Technologies
   Divyashree Techno Park, Whitefield
   Bangalore, Karnataka  560066
   India

   EMail: dhruv.ietf@gmail.com

   Mahendra Singh Negi
   RtBrick India
   N-17L, Floor-1, 18th Cross Rd, HSR Layout Sector-3
   Bangalore, Karnataka  560102
   India

   EMail: mahend.ietf@gmail.com

   Mike Koldychev
   Cisco Systems, Inc.
   2000 Innovation Drive
   Kanata, Ontario  K2K 3E8
   Canada

   Email: mkoldych@cisco.com

   Zafar Ali
   Cisco Systems, Inc.

   Email: zali@cisco.com

Authors' Addresses

   Siva Sivabalan
   Ciena Corporation

   EMail: msiva282@gmail.com





Sivabalan, et al.        Expires October 1, 2021               [Page 20]

Internet-Draft              Binding Label/SID                 March 2021


   Clarence Filsfils
   Cisco Systems, Inc.
   Pegasus Parc
   De kleetlaan 6a, DIEGEM  BRABANT 1831
   BELGIUM

   EMail: cfilsfil@cisco.com


   Jeff Tantsura
   Juniper Networks

   EMail: jefftant.ietf@gmail.com


   Stefano Previdi
   Huawei Technologies

   EMail: stefano@previdi.net


   Cheng Li
   Huawei Technologies
   Huawei Campus, No. 156 Beiqing Rd.
   Beijing  100095
   China

   EMail: c.l@huawei.com























Sivabalan, et al.        Expires October 1, 2021               [Page 21]
